Ran Plan for 2 projects:

1. dir: `infrastructure/core/vpc` workspace: `default`
1. dir: `infrastructure/core/eks` workspace: `default`

### 1. dir: `infrastructure/core/vpc` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/core/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-dev.dev.appcd.io/lock?id=appcd-dev%252FDogeAPI%252Finfrastructure%252Fcore%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/core/vpc`

---
### 2. dir: `infrastructure/core/eks` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.eks.module.fargate_profile["kube-system-2a"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["kube-system-2c"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["kube-system-2c"].data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["kube-system-2a"].data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["kube-system-2b"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["kube-system-2b"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["kube-system-2a"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.eks.module.fargate_profile["kube-system-2c"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.fargate_profile["kube-system-2b"].data.aws_partition.current: Reading...
module.eks.module.fargate_profile["kube-system-2b"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.eks.module.fargate_profile["kube-system-2c"].data.aws_partition.current: Reading...
module.eks.module.fargate_profile["kube-system-2a"].data.aws_partition.current: Reading...
module.eks.module.fargate_profile["kube-system-2c"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["kube-system-2a"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["kube-system-2b"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=180217099948]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=180217099948]
module.eks.module.fargate_profile["kube-system-2b"].data.aws_caller_identity.current: Read complete after 0s [id=180217099948]
module.eks.module.fargate_profile["kube-system-2c"].data.aws_caller_identity.current: Read complete after 0s [id=180217099948]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["kube-system-2a"].data.aws_caller_identity.current: Read complete after 0s [id=180217099948]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::180217099948:assumed-role/atlantis-access/aws-go-sdk-1693363058848427547]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/demo-demo/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "demo"
          + "Name"        = "/aws/eks/demo-demo/cluster"
          + "Terraform"   = "True"
        }
      + tags_all          = {
          + "Environment" = "demo"
          + "Name"        = "/aws/eks/demo-demo/cluster"
          + "Terraform"   = "True"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+ resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "demo"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"] will be created
+ resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Terraform"
      + resource_id = (known after apply)
      + value       = "True"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "demo-demo"
      + configuration_values = jsonencode(
            {
              + computeType = "Fargate"
              + resources   = {
                  + limits   = {
                      + cpu    = "0.25"
                      + memory = "256M"
                    }
                  + requests = {
                      + cpu    = "0.25"
                      + memory = "256M"
                    }
                }
            }
        )
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all             = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "demo-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all             = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "demo-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all             = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+ resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "demo-demo"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + version                   = "1.24"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-04b60b5362d2d3a61",
              + "subnet-06a1939485b03e1e8",
              + "subnet-0a1eeecd978b2d990",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "demo"
          + "Name"        = "demo-demo-eks-irsa"
          + "Terraform"   = "True"
        }
      + tags_all        = {
          + "Environment" = "demo"
          + "Name"        = "demo-demo-eks-irsa"
          + "Terraform"   = "True"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
+ resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "demo-demo-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all    = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "demo-demo-cluster-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "demo-demo-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.time_sleep.this[0] will be created
+ resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "demo-demo"
          + "cluster_version"                    = "1.24"
        }
    }

  # module.eks.module.fargate_profile["kube-system-2a"].aws_eks_fargate_profile.this[0] will be created
+ resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "demo-demo"
      + fargate_profile_name   = "kube-system-2a"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0a1eeecd978b2d990",
        ]
      + tags                   = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + selector {
          + namespace = "kube-system"
        }

      + timeouts {}
    }

  # module.eks.module.fargate_profile["kube-system-2a"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Fargate profile IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "kube-system-2a-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2a"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2a"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2b"].aws_eks_fargate_profile.this[0] will be created
+ resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "demo-demo"
      + fargate_profile_name   = "kube-system-2b"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06a1939485b03e1e8",
        ]
      + tags                   = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + selector {
          + namespace = "kube-system"
        }

      + timeouts {}
    }

  # module.eks.module.fargate_profile["kube-system-2b"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Fargate profile IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "kube-system-2b-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2b"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2b"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2c"].aws_eks_fargate_profile.this[0] will be created
+ resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "demo-demo"
      + fargate_profile_name   = "kube-system-2c"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-04b60b5362d2d3a61",
        ]
      + tags                   = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }

      + selector {
          + namespace = "kube-system"
        }

      + timeouts {}
    }

  # module.eks.module.fargate_profile["kube-system-2c"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Fargate profile IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "kube-system-2c-"
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all              = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2c"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["kube-system-2c"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::180217099948:role/atlantis-access",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
+ resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/demo-demo"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
+ resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "demo-demo cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
      + tags_all                           = {
          + "Environment" = "demo"
          + "Terraform"   = "True"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = "module.eks.cluster_arn"
+ cluster_name = "module.eks.cluster_name"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/core/eks`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-dev.dev.appcd.io/lock?id=appcd-dev%252FDogeAPI%252Finfrastructure%252Fcore%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/core/eks`
</details>
Plan: 28 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`